import { Comment } from '../types';

export const FORUM_TOPIC_COMMENTS: Comment[] = [
  {
    id: '1',
    author: 'Игрок Игрок 1',
    avatar:
      'https://iconape.com/wp-content/files/mb/10833/png/iconfinder_1_avatar_2754574.png',
    text: 'Команда — это не случайные люди, оказавшиеся в одном проекте, и не сотрудники, которые сидят в одном офисе. Это те, кого объединяет общая цель. Вам предстоит совместный путь, на котором придётся принимать общие решения, вместе учиться и распределять нагрузку, отказываться от каких-то идей и искать решения. У всех членов команды разные характеры и опыт, каждый видит процесс разработки по-своему. Одной из задач будет наладить взаимодействие внутри и выстроить процессы так, чтобы это устраивало всех членов команды.',
    date: '2024-08-31 12:00:00',
  },
  {
    id: '2',
    author: 'Игрок Игрок 2',
    avatar:
      'https://iconape.com/wp-content/files/mb/10833/png/iconfinder_1_avatar_2754574.png',
    text: 'Команда — это не случайные люди, оказавшиеся в одном проекте, и не сотрудники, которые сидят в одном офисе.',
    date: '2024-08-31 12:20:00',
  },
  {
    id: '3',
    author: 'Игрок Игрок 3',
    avatar:
      'https://iconape.com/wp-content/files/mb/10833/png/iconfinder_1_avatar_2754574.png',
    text: 'Команда — это не случайные люди, оказавшиеся в одном проекте, и не сотрудники, которые сидят в одном офисе.',
    date: '2024-08-31 12:20:00',
  },
  {
    id: '4',
    author: 'Игрок Игрок 4',
    avatar:
      'https://iconape.com/wp-content/files/mb/10833/png/iconfinder_1_avatar_2754574.png',
    text: 'Команда — это не случайные люди, оказавшиеся в одном проекте, и не сотрудники, которые сидят в одном офисе.',
    date: '2024-08-31 12:20:00',
  },
  {
    id: '5',
    author: 'Игрок Игрок 5',
    avatar:
      'https://iconape.com/wp-content/files/mb/10833/png/iconfinder_1_avatar_2754574.png',
    text: 'Команда — это не случайные люди, оказавшиеся в одном проекте, и не сотрудники, которые сидят в одном офисе.',
    date: '2024-08-31 12:20:00',
  },
  {
    id: '6',
    author: 'Игрок Игрок 6',
    avatar:
      'https://iconape.com/wp-content/files/mb/10833/png/iconfinder_1_avatar_2754574.png',
    text: 'Команда — это не случайные люди, оказавшиеся в одном проекте, и не сотрудники, которые сидят в одном офисе.',
    date: '2024-08-31 12:20:00',
  },
  {
    id: '7',
    author: 'Игрок Игрок 7',
    avatar:
      'https://iconape.com/wp-content/files/mb/10833/png/iconfinder_1_avatar_2754574.png',
    text: 'Команда — это не случайные люди, оказавшиеся в одном проекте, и не сотрудники, которые сидят в одном офисе.',
    date: '2024-08-31 12:20:00',
  },
  {
    id: '8',
    author: 'Игрок Игрок 8',
    avatar:
      'https://iconape.com/wp-content/files/mb/10833/png/iconfinder_1_avatar_2754574.png',
    text: 'Команда — это не случайные люди, оказавшиеся в одном проекте, и не сотрудники, которые сидят в одном офисе.',
    date: '2024-08-31 12:20:00',
  },
  {
    id: '9',
    author: 'Игрок Игрок 9',
    avatar:
      'https://iconape.com/wp-content/files/mb/10833/png/iconfinder_1_avatar_2754574.png',
    text: 'Команда — это не случайные люди, оказавшиеся в одном проекте, и не сотрудники, которые сидят в одном офисе.',
    date: '2024-08-31 12:20:00',
  },
  {
    id: '10',
    author: 'Игрок Игрок 10',
    avatar:
      'https://iconape.com/wp-content/files/mb/10833/png/iconfinder_1_avatar_2754574.png',
    text: 'Команда — это не случайные люди, оказавшиеся в одном проекте, и не сотрудники, которые сидят в одном офисе.',
    date: '2024-08-31 12:20:00',
  },
];
